public_html/blogs/cell-auto.html

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Клеточные автоматы</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Пожалуй надо сделать небольшую веселую статью для
популяризации этих вычислимых объектов, правила для которых
являются "множествами непрерывных эндоморфизмов в сдвиговом пространстве".
</p>

<p>
Это могло бы быть интересным на следующем ITGM и достаточно
функциональным для FProg-комьюнити. Особенно если описать все на хаскеле -
заодно хороший повод в нем наконец разобраться.
</p>

<p>
Можно было бы рассмотреть:
</p>
<ul class="org-ul">
<li>"Жизнь" Конвея
</li>
<li>"WireWorld" Брайаном Сильверманом (особенно интересен в
в отношении применимости к проекту симуляции электронных
схем.
</li>
<li>Алгоритм волновой трассировки Ли для поиска путей
(например, в двумерных играх, или для трассировки печатных плат,
что даже лучше)
</li>
<li>"Муравей Ленгтона" и его эквивалентность машине Тьюринга
с 2 символами и 4 состояниями
Работа Пауля Чепмена и немного про Регистровые Машины Минского
Мозаичные плоскости Пенроуза как более интересный вид пространства
для клеточных автоматов
</li>
</ul>

<p>
Большинство этих вещей довольно просты для понимания и неизвестны широкому
кругу программистов - значит будет интересно.
</p>
</div>
</heading>
